# Создайте программу медицинская анкета, где вы запросите у пользователя такие данные, как имя, фамилию, возраст, и вес.# И выведите результат согласно которому пациент в хорошем состоянии, если ему до 30 лет и вес от 50 и до 120 кг,# Пациенту требуется начать вести правильный образ жизни, если ему более 30 и вес меньше 50 или больше 120 кг# Пациенту требуется врачебный осмотр, если ему более 40 и вес менее 50 или больше 120 кг.# Все остальные варианты вы можете обработать на ваш вкус и полет фантазии =)# Формула не отражает реальной действительности и здесь используется только ради примера.# Пример: Вася Пупкин, 29 год, вес 90 - хорошее состояние# Пример: Вася Пупкин, 31 год, вес 121 - следует заняться собой# Пример: Вася Пупкин, 31 год, вес 49 - следует заняться собой# Пример: Вася Пупкин, 41 год, вес 121 - следует обратится к врачу!# Пример: Вася Пупкин, 41 год, вес 49 - следует обратится к врачу!def get_condition(age, weight):    if age < 30 and 50 < weight < 120:        condition = 'You are in good condition'    elif 30 < age < 40 and (weight < 50 or weight > 120):        condition = 'You need a healthy lifestyle'    elif age > 40 and (weight < 50 or weight > 120):        condition = 'You\'ll need to go to doctor'    else:        condition = 'I\'m too stupid for this calculation'    return conditiondef message_to_user(name, surname, age, weight, condition):    return f'{name} {surname}, age {age}, weight {weight} - {condition}'user_name = input('Input your name: ')user_surname = input('Input your surname: ')user_age = int(input('Input your age: '))user_weight = float(input('Input your weight: '))print(message_to_user(user_name, user_surname, user_age, user_weight, get_condition(user_age, user_weight)))